import matplotlib.pyplot as plt

# Значения потерь для перплексии и рандома
losses_perplexity = [4.172889642715454, 3.382838254928589, 3.2346687151590983, 3.3951944737434387, 3.8732090057373045, 3.9890785309473675, 4.3775848860059465]
losses_random = [2.8184590269088745, 2.3218062298774718, 2.301520724773407, 2.3996292119026186, 2.599904257583618, 2.74729692363739, 3.073617096233368]

# Проценты отфильтрованных данных
percentages = ['90%', '80%', '70%', '60%', '50%', '40%', '30%']

plt.figure(figsize=(10, 6))

plt.plot(percentages, losses_perplexity, marker='o', label='Основанный на перплексии фильтр')
plt.plot(percentages, losses_random, marker='o', label='Случайный фильтр')

plt.title('Сравнение потерь валидации')
plt.xlabel('Процент оригинальной информации')
plt.ylabel('Уровень потерь')
plt.legend()
plt.grid(True)
plt.show()
